examples/radon/readme.org
** Get the repo & depdencies
#+BEGIN_SRC bash
git clone --recurse-submodules --single-branch --branch mpi_warmup_framework git@github.com:stan-dev/cmdstan.git
#+END_SRC

** Edit make/local
#+BEGIN_SRC bash
  MPI_ADAPTED_WARMUP = 1
  CXXFLAGS += -isystem /path/to/mpi/include
  TBB_CXX_TYPE=clang              # your cpp compiler
#+END_SRC

** Compile
#+BEGIN_SRC bash
make clean-all;
make -j4 examples/radon/radon
#+END_SRC

** Run
#+BEGIN_SRC bash
  mpiexec -n 4 -l ./radon sample num_cross_chains=4 data file=radon.data.R # MPICH
#+END_SRC
or
#+BEGIN_SRC bash
  mpiexec -n 4 --tag-output ./radon sample num_cross_chains=4 data file=radon.data.R # OpenMPI
#+END_SRC
runs 4 chains with cross-chain warmup, using 4 processes.
